Repository: felix-leg/bodyreswitcher
Catalog: po/*/bodyreswitcher.po
Languages: pl_pl

source: Critical error happened. Terminating the program.
pl_pl: Wystąpił błąd krytyczny. Przerywam program.

source: %{#Message box title#}%Program error
pl_pl: Błąd programu

source: Unable to initialize SDL2:
pl_pl: Nie udało się zainicjować SDL2:

source: Unable to initialize SDL2 Image module:
pl_pl: Nie udało się zainicjować modułu SDL2 Image:

source: Unable to initialize SDL2 Font module:
pl_pl: Nie udało się zainicjować modułu SDL2 Font:

source: Unable to initialize SDL2 Mixer module:
pl_pl: Nie udało się zainicjować modułu SDL2 Mixer:

source: Unable to open SDL2 audio system:
pl_pl: Nie udało się uruchomić systemu audio SDL2:

source: Unable to get available display modes on 1st monitor:
pl_pl: Pobranie dostępnych trybów wyświetlania na pierwszym monitorze nieudane:

source: Unable to get information about %{#display#}%mode number %{num}%:
pl_pl: Pobranie informacji o trybie wyświetlania o numerze %{num}% nieudane:

source: Unable to get information about desktop's display mode:
pl_pl: Nie można pobrać informacji o trybie wyświetlania dla pulpitu:

source: Unable to create a window:
pl_pl: Nie udało się utworzyć okna:

source: Unable to get the surface from the window:
pl_pl: Nie udało się pobrać płótna z okna:

source: Unable to create window renderer:
pl_pl: Nie udało się stworzyć malarza dla okna:

source: Unable to get current display mode:
pl_pl: Nie można pobrać informacji o trybie wyświetlania dla pulpitu:

source: Can't change the fullscreen state:
pl_pl: Nie można zmienić na pełny ekran lub okno:

source: Unable to change into display mode '%{mode_text}%':
pl_pl: Nie można przełączyć na tryb wyświetlania '%{mode_text}%':

source: Tried to move window surface
pl_pl: Podjęto próbę przeniesienia obiektu płótna okna

source: Can't load file '%{filename}%': file doesn't exist
pl_pl: Nie można załadować pliku '%{filename}%': plik nie istnieje

source: Can't load file '%{filename}%':%{#SDL Image Error#}%
pl_pl: Nie można załadować obrazu '%{filename}%':

source: Tried to overwrite window surface
pl_pl: Podjęto próbę nadpisania płótna okna

source: Unable to create a RGB Surface:
pl_pl: Nie udało się stworzyć płótna RGB:

source: Unable to create a RGBA Surface:
pl_pl: Nie udało się stworzyć płótna RGBA:

source: Can't optimize surface:
pl_pl: Nie można zoptimalizować płótna:

source: Unable to draw with renderer:
pl_pl: Malarz nie jest w stanie malować:

source: Can't load font '%{filename}%': file doesn't exist
pl_pl: Nie udało się załadować fontu '%{filename}%': plik nie istnieje

source: Can't load font '%{filename}%' with size %{size}%pt:
pl_pl: Nie udało się załadować fontu '%{filename}%' o rozmiarze %{size}%pt:

source: Couldn't found a font to fit '%{text}%' into a %{width}%x%{height}% rectangle
pl_pl: Nie udało się znaleźć takiego fontu, aby zmieścić tekst '%{text}%' w prostokącie o wymiarach %{width}% na %{height}%

source: Couldn't find a font of the desired %{size}%px size
pl_pl: Nie udało się znaleźć fontu o rozmiarze %{size}% piksel%{size!P:a,i,ów}%

source: Can't render the text '%{text}%':
pl_pl: Nie można narysować tekstu '%{text}%':

source: Unable to fit the word %{wide_word}% into the desired %{max_width}%px size
pl_pl: Przestrzeń o rozmiarze %{max_width}% piksel%{max_width!P:a,i,ów}% jest za mała dla słowa %{wide_word}%

source: Unable to load music file '%{filename}%': file doesn't exists
pl_pl: Nie udało się załadować pliku z muzyką '%{filename}%': plik nie istnieje

source: Unable to load music file '%{filename}%':
pl_pl: Nie udało się załadować pliku z muzyką '%{filename}%':

source: Can't play the music:
pl_pl: Nie można odtworzyć muzyki:

source: Unable to load sound file '%{filename}%': file doesn't exists
pl_pl: Nie udało się załadować pliku z dźwiękiem '%{filename}%': plik nie istnieje

source: Unable to load sound file '%{filename}%':
pl_pl: Nie udało się załadować pliku z dźwiękiem '%{filename}%':

source: Unable to play sound:
pl_pl: Nie można odtworzyć dźwięku:

source: %{#Main menu#}%What it's about?
pl_pl: O co tu chodzi?

source: %{#Main menu#}%New game
pl_pl: Nowa gra

source: %{#Main menu#}%Options
pl_pl: Opcje

source: %{#Main menu#}%Exit
pl_pl: Wyjście

source: Music: On
pl_pl: Muzyka wł.

source: Music: Off
pl_pl: Muzyka wył.

source: Fullscreen: On
pl_pl: Pełny ekran

source: Fullscreen: Off
pl_pl: Okno

source: Set screen size
pl_pl: Wybierz rozmiar ekranu

source: %{#Back to main menu#}%Back
pl_pl: Wróć

source: %{#Video modes list#}%<- Previous
pl_pl: <- Poprzednie

source: %{#Video modes list#}%Next ->
pl_pl: Następne ->

source: %{#Video modes list#}%Cancel
pl_pl: Anuluj

source: %{#About screen#}%Back
pl_pl: Cofnij

source: One night The Crazy Professor made an amazing machine that gives one the ability to switch body with another person. Such an invention! Unfortunately he forgot to close his home and a bunch of kids entered his laboratory and started playing with his invention. What a mess! They switched their bodies and now they need You to make things right.
pl_pl: Pewnej nocy Szalony Profesor zbudował wspaniałą maszynę, która daje dwóm osobom możliwość zamiany ciał. Cóż za wynalazek! Niestety zapominał zamknąć drzwi do swojego domu i banda dzieciaków wdarła się do jego laboratorium i zaczęła bawić się jego wynalazkiem. Cóż za bałagan! Pozamieniali się ciałami i teraz potrzebują Twojej pomocy by to naprawić.

source: But The Crazy Profesor has return and has got bad news! He says two bodies that were switched now can't be switched back. Oh noes! But you have got an idea: what if we "go around" the problem and try to put back persons in in their right bodies by switching them with other bodies? That's the plan!
pl_pl: Lecz oto Szalony Profesor wraca i to ze złą wiadomością! Mówi, że każde dwa ciała, których osoby zostały zamienione miejscami, nie mogą zostać zamienione ponownie. O rany! Ale przychodzi Ci do głowy myśl: a gdyby tak "obejść" problem przez zamienienie innych dwóch ciał miejscami? To jest pomysł!

source: So, you became the last hope for those poor kids. Can you solve the puzzle and make them happy again?
pl_pl: Tak oto zostałeś ostatnią nadzieją dla tych biednych dzieci. Czy potrafisz rozwiązać tę łamigłówkę i uczynić je znów szczęśliwymi?

source: %{#Game difficulty#}%Easy
pl_pl: Łatwa

source: %{#Game difficulty#}%Normal
pl_pl: Średnia

source: %{#Game difficulty#}%Hard
pl_pl: Trudna

source: %{#Close menu#}%Back
pl_pl: Wróć

source: %{# A '|' separated list of the first letters of kids' names. Must be 18 of them. #}%A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|R|S
pl_pl: A|B|C|D|E|F|G|H|I|J|K|L|M|N|O|P|R|S

source: %{#1st kid name#}%Amelia
pl_pl: Agat%{+C:a,y,cie,ę,ą,cie,o}%

source: %{#2nd kid name#}%Brooke
pl_pl: Bartosz%{+C:,a,owi,a,em,u,u}%

source: %{#3rd kid name#}%Charlie
pl_pl: Czesław%{+C:,a,owi,a,em,ie,ie}%

source: %{#4th kid name#}%Daisy
pl_pl: Domini%{+C:ka,ki,ce,kę,ką,ce,ko}%

source: %{#5th kid name#}%Emily
pl_pl: Ew%{+C:a,y,ie,ę,ą,ie,o}%

source: %{#6th kid name#}%Freddie
pl_pl: Filip%{+C:,a,owi,a,em,ie,ie}%

source: %{#7th kid name#}%George
pl_pl: Grzegorz%{+C:,a,owi,a,em,u,u}%

source: %{#8th kid name#}%Harry
pl_pl: Hektor%{+C:,a,owi,a,em,ze,ze}%

source: %{#9th kid name#}%Isabel
pl_pl: Izabel%{+C:a,i,i,ę,ą,i,o}%

source: %{#10th kid name#}%Julia
pl_pl: Jagod%{+C:a,y,zie,ę,ą,zie,o}%

source: %{#11th kid name#}%Katie
pl_pl: Karolin%{+C:a,y,ie,ę,ą,ie,o}%

source: %{#12th kid name#}%Lilly
pl_pl: Lar%{+C:a,y,ze,ę,ą,ze,o}%

source: %{#13th kid name#}%Matthew
pl_pl: Mieszk%{+C:o,a,owi,a,iem,u,u}%

source: %{#14th kid name#}%Nancy
pl_pl: Natali%{+C:a,i,i,ę,ą,i,o}%

source: %{#15th kid name#}%Oliver
pl_pl: Ores%{+C:t,ta,towi,ta,tem,cie,cie}%

source: %{#16th kid name#}%Peter
pl_pl: Piotr%{+C:,a,owi,a,em,ze,ze}%

source: %{#17th kid name#}%Robert
pl_pl: Rober%{+C:t,ta,towi,ta,tem,cie,cie}%

source: %{#18th kid name#}%Sophie
pl_pl: Sar%{+C:a,y,ze,ę,ą,ze,o}%

source: You Won!
pl_pl: Wygrałeś!

source: You Lose!
pl_pl: Przegrałeś!

source: Undo (%{count}% left)
pl_pl: Cofinij (pozostał%{count!P:a,y,o}% %{count}% prób%{count!P:a,y,}%)

source: Call for reinforcements
pl_pl: Wezwij posiłki

source: End game
pl_pl: Zakończ

source: %{#When selected one body#}%Switch %{firstKid}% (in %{firstBody}%'s body) with...
pl_pl: Zamień %{firstKid!C=acc}% (w ciele %{firstBody!C=gen}%) z...

source: Unselect
pl_pl: Odznacz

source: %{#When selected two bodies#}%Switch %{firstKid}% (in %{firstBody}%'s body) with %{secondKid}% (in %{secondBody}%'s body)
pl_pl: Zamień %{firstKid!C=acc}% (w ciele %{firstBody!C=gen}%) z %{secondKid!C=ins}% (w ciele %{secondBody!C=gen}%)

source: Switching imposible!
pl_pl: Zamiana ciał niemożliwa!
